/** @file

Copyright (c) 2006 - 2014, Byosoft Corporation.<BR>
All rights reserved.This software and associated documentation (if any)
is furnished under a license and may only be used or copied in
accordance with the terms of the license. Except as permitted by such
license, no part of this software or documentation may be reproduced,
stored in a retrieval system, or transmitted in any form or by any
means without the express written consent of Byosoft Corporation.

File Name:
  Pcie.uni

Abstract:
  The definition of string used in Via Video Setup setting.

Revision History:

$END--------------------------------------------------------------------

**/

/=#
#langdef   en-US "English"
#langdef   zh-Hans "\wide中文\narrow"

#string STR_COM_EMPTY                      #language en-US ""
                                           #language zh-Hans ""

                                           
#string STR_PCIE_FORM                       #language en-US "Pcie Configuration"
                                           #language zh-Hans ""
#string STR_PCIE_FORM_HELP                  #language en-US "Pcie Configuration"
                                           #language zh-Hans ""
                                           
#string STR_PCIE_FPGA_MODE                       #language en-US "Pcie FPGA Mode"
                                           #language zh-Hans ""
#string STR_USB_MODE_HELP                  #language en-US "Mode 1:EHCI only mode\nMode 2:EHCI and xHCI mode\nMode 3:xHCI only mode\nMode 4:EHCI and xHCI mode (USB2.0 device on P1~P6 controlled by EHCI and on P7~P9 controlled by xHCI)"
                                           #language zh-Hans ""
#string STR_DISABLED                       #language en-US "Disabled"
                                           #language zh-Hans ""
#string STR_ENABLED                          #language en-US "Enabled"
                                           #language zh-Hans ""
#string STR_RP_LOCK_BIT_CTRL		#language en-US "RP Lock-Bit Control"                 
                                           #language zh-Hans ""

#string STR_PEG_ID_LOCK		#language en-US "PEG(D2F0) ID_Lock Bit"             
                                           #language zh-Hans ""

#string STR_PE0_ID_LOCK		#language en-US "PE0(D3F0) ID_Lock Bit"          
                                           #language zh-Hans ""
#string STR_PE1_ID_LOCK		#language en-US "PE1(D3F1) ID_Lock Bit"          
                                           #language zh-Hans ""
#string STR_PE2_ID_LOCK		#language en-US "PE2(D3F2) ID_Lock Bit"          
                                           #language zh-Hans ""
#string STR_PE3_ID_LOCK		#language en-US "PE3(D3F3) ID_Lock Bit"          
                                           #language zh-Hans ""
#string STR_PEG0_ID_LOCK		#language en-US "PEG0(D4F0) ID_Lock Bit"              
                                           #language zh-Hans ""
#string STR_PEG1_ID_LOCK		#language en-US "PEG1(D4F1) ID_Lock Bit"          
                                           #language zh-Hans ""
#string STR_PEG2_ID_LOCK		#language en-US "PEG2(D5F0) ID_Lock Bit"          
                                           #language zh-Hans ""
#string STR_PEG3_ID_LOCK		#language en-US "PEG3(D5F1) ID_Lock Bit"     
                                           #language zh-Hans ""
#string STR_UNLOCK		#language en-US "Unlock"                 
                                           #language zh-Hans ""
#string STR_LOCK	#language en-US "Lock"                 
                                           #language zh-Hans ""

#string STR_MSGC_PIC_INTROUT_CTRL	#language en-US "MSGC PIC INT Routing Control"     
                                           #language zh-Hans ""
#string STR_PEG_MSG2PCIE_INTX	#language en-US "PEG_MSGC->PCIE_INTx"     
                                           #language zh-Hans ""
#string STR_PE0_MSG2PCIE_INTX	#language en-US "PE0_MSGC->PCIE_INTx"     
                                           #language zh-Hans ""
#string STR_PE1_MSG2PCIE_INTX	#language en-US "PEG_MSGC->PCIE_INTx"     
                                           #language zh-Hans ""
#string STR_PE2_MSG2PCIE_INTX	#language en-US "PE2_MSGC->PCIE_INTx"     
                                           #language zh-Hans ""
#string STR_PE3_MSG2PCIE_INTX	#language en-US "PE3_MSGC->PCIE_INTx"     
                                           #language zh-Hans ""
#string STR_PEG0_MSG2PCIE_INTX	#language en-US "PEG0_MSGC->PCIE_INTx"     
                                           #language zh-Hans ""
#string STR_PEG1_MSG2PCIE_INTX	#language en-US "PEG1_MSGC->PCIE_INTx"     
                                           #language zh-Hans ""
#string STR_PEG2_MSG2PCIE_INTX	#language en-US "PEG2_MSGC->PCIE_INTx"     
                                           #language zh-Hans ""
#string STR_PEG3_MSG2PCIE_INTX	#language en-US "PEG3_MSGC->PCIE_INTx"     
                                           #language zh-Hans ""
#string STR_PCIE_INTA	#language en-US "PCIE_INTA"     
                                           #language zh-Hans ""
#string STR_PCIE_INTB	#language en-US "PCIE_INTB"     
                                           #language zh-Hans ""
#string STR_PCIE_INTC	#language en-US "PCIE_INTC"     
                                           #language zh-Hans ""
#string STR_PCIE_INTD	#language en-US "PCIE_INTD"     
                                           #language zh-Hans ""
#string STR_PEG_PCIE_INTX2NB2SB_INTX	#language en-US "PEG_PCIE_INTx Routing"     
                                           #language zh-Hans ""
#string STR_PE0_PCIE_INTX2NB2SB_INTX	#language en-US "PE0_PCIE_INTx Routing"     
                                           #language zh-Hans ""
#string STR_PE1_PCIE_INTX2NB2SB_INTX	#language en-US "PE1_PCIE_INTx Routing"     
                                           #language zh-Hans ""
#string STR_PE2_PCIE_INTX2NB2SB_INTX	#language en-US "PE2_PCIE_INTx Routing"     
                                           #language zh-Hans ""
#string STR_PE3_PCIE_INTX2NB2SB_INTX	#language en-US "PE3_PCIE_INTx Routing"     
                                           #language zh-Hans ""
#string STR_PEG0_PCIE_INTX2NB2SB_INTX	#language en-US "PEG0_PCIE_INTx Routing"     
                                           #language zh-Hans ""
#string STR_PEG1_PCIE_INTX2NB2SB_INTX	#language en-US "PEG1_PCIE_INTx Routing"     
                                           #language zh-Hans ""
#string STR_PEG2_PCIE_INTX2NB2SB_INTX	#language en-US "PEG2_PCIE_INTx Routing"     
                                           #language zh-Hans ""
#string STR_PEG3_PCIE_INTX2NB2SB_INTX	#language en-US "PEG3_PCIE_INTx Routing"     
                                           #language zh-Hans ""
#string STR_NB2SB_INTA	#language en-US "NB2SB_INTA"     
                                           #language zh-Hans ""
#string STR_NB2SB_INTB	#language en-US "NB2SB_INTB"     
                                           #language zh-Hans ""
#string STR_NB2SB_INTC	#language en-US "NB2SB_INTC"     
                                           #language zh-Hans ""
#string STR_NB2SB_INTD	#language en-US "NB2SB_INTD"     
                                           #language zh-Hans ""
#string STR_MSI_INT_CTRL	#language en-US "MSI Interrupt Control"     
                                           #language zh-Hans ""
#string STR_DISABLE	#language en-US "Disable"     
                                           #language zh-Hans ""
#string STR_ENABLE	#language en-US "Enable"     
                                           #language zh-Hans ""


#string STR_PEG23_APIC_INT_CTRL							#language en-US "PEG/2/3 APIC INT Routing Control"     
#string STR_PEG_APIC_IRQ								#language en-US "PEG_PCIE_APIC Routing"     
#string STR_PEG2_APIC_IRQ								#language en-US "PEG2 PCIE_APIC Routing"   
#string STR_PEG3_APIC_IRQ								#language en-US "PEG3 PCIE_APIC Routing"   
#string STR_INA_IRQ8								#language en-US "INA->IRQ8"     
#string STR_INA_IRQ9								#language en-US "INA->IRQ9"    
#string STR_INA_IRQ10								#language en-US "INA->IRQ10"    
#string STR_INA_IRQ11								#language en-US "INA->IRQ11" 
#string STR_INA_IRQ0								#language en-US "INA->IRQ0"     
#string STR_INA_IRQ1								#language en-US "INA->IRQ1"    
#string STR_INA_IRQ2 							  #language en-US "INA->IRQ2"    
#string STR_INA_IRQ3								#language en-US "INA->IRQ3" 
#string STR_INA_IRQ4								#language en-US "INA->IRQ4"     
#string STR_INA_IRQ5								#language en-US "INA->IRQ5"    
#string STR_INA_IRQ6  							#language en-US "INA->IRQ6"    
#string STR_INA_IRQ7  							#language en-US "INA->IRQ7" 
   
#string STR_PCIERST                                #language en-US "Reset PCIE When Link Fail"
#string STR_PCIE_RST_PEG                                 #language en-US "Reset PEG When Link Fail"
#string STR_PCIE_RST_PEG2                               #language en-US "Reset PEG2 When Link Fail"
#string STR_PCIE_RST_PEG3                                 #language en-US "Reset PEG3 When Link Fail"
#string STR_PCIE_RST_PE0                                 #language en-US "Reset PE0 When Link Fail"

#string STR_PCIE_RST_PE1                                 #language en-US "Reset PE1 When Link Fail"
#string STR_PCIE_RST_PE2                                 #language en-US "Reset PE2 When Link Fail"
#string STR_PCIE_RST_PE3                                 #language en-US "Reset PE3 When Link Fail"
#string STR_PCIE_RST_PEG0                           #language en-US "Reset PEG0 When Link Fail"
#string STR_PCIE_RST_PEG1                           #language en-US "Reset PEG1 When Link Fail"
#string STR_PCIE_LINK_SPD                      #language en-US "PCIE RP Capability Control"
#string STR_PCIE_PEG_LINK_SPD                      #language en-US "PCIE PEG Capability Control"
#string STR_PCIE_PE0_LINK_SPD                      #language en-US "PCIE PE0 Capability Control"
#string STR_PCIE_PE1_LINK_SPD                      #language en-US "PCIE PE1 Capability Control"
#string STR_PCIE_PE2_LINK_SPD                      #language en-US "PCIE PE2 Capability Control"
#string STR_PCIE_PE3_LINK_SPD                      #language en-US "PCIE PE3 Capability Control"
#string STR_PCIE_PEG0_LINK_SPD                      #language en-US "PCIE PEG0 Capability Control"
#string STR_PCIE_PEG1_LINK_SPD                      #language en-US "PCIE PEG1 Capability Control"
#string STR_PCIE_PEG2_LINK_SPD                      #language en-US "PCIE PEG2 Capability Control"
#string STR_PCIE_PEG3_LINK_SPD                      #language en-US "PCIE PEG3 Capability Control"


#string STR_AUTO                              #language en-US "Auto"
#string STR_FORCE_GEN1                                #language en-US "Force Gen1"
#string STR_FORCE_GEN2                                #language en-US "Force Gen2"
#string STR_FORCE_GEN3                                #language en-US "Force Gen3"
#string STR_FORCE_BY_PORT                                #language en-US "By Port"
#string STR_PCIE_EQ                                #language en-US "PCIE EQ Control"
#string STR_DO_EQ                                #language en-US "Do EQ"
#string STR_SKIP_WITH_TABLE                                #language en-US "Skip EQ with Look-up Preset Table"
#string STR_SKIP_WITH_MANUAL                                #language en-US "Skip EQ with Manual Preset"

#string STR_PRE_DST_X8BL0                                #language en-US "Manual Preset - DS Tx X8B_L0"
#string STR_PRE_DSR_X8BL0                                #language en-US "Manual Preset - DS Rx X8B_L0"
#string STR_PRE_UST_X8BL0                                #language en-US "Manual Preset - US Tx X8B_L0"
#string STR_PRE_USR_X8BL0                                #language en-US "Manual Preset - US Rx X8B_L0"

#string STR_PRE_DST_X8BL1                                #language en-US "Manual Preset - DS Tx X8B_L1"
#string STR_PRE_DSR_X8BL1                                #language en-US "Manual Preset - DS Rx X8B_L1"
#string STR_PRE_UST_X8BL1                                #language en-US "Manual Preset - US Tx X8B_L1"
#string STR_PRE_USR_X8BL1                                #language en-US "Manual Preset - US Rx X8B_L1"


#string STR_PRE_DST_X8BL2                                #language en-US "Manual Preset - DS Tx X8B_L2"
#string STR_PRE_DSR_X8BL2                                #language en-US "Manual Preset - DS Rx X8B_L2"
#string STR_PRE_UST_X8BL2                                #language en-US "Manual Preset - US Tx X8B_L2"
#string STR_PRE_USR_X8BL2                                #language en-US "Manual Preset - US Rx X8B_L2"

#string STR_PRE_DST_X8BL3                                #language en-US "Manual Preset - DS Tx X8B_L3"
#string STR_PRE_DSR_X8BL3                                #language en-US "Manual Preset - DS Rx X8B_L3"
#string STR_PRE_UST_X8BL3                                #language en-US "Manual Preset - US Tx X8B_L3"
#string STR_PRE_USR_X8BL3                                #language en-US "Manual Preset - US Rx X8B_L3"

#string STR_PRE_DST_X8BL4                                #language en-US "Manual Preset - DS Tx X8B_L4"
#string STR_PRE_DSR_X8BL4                                #language en-US "Manual Preset - DS Rx X8B_L4"
#string STR_PRE_UST_X8BL4                                #language en-US "Manual Preset - US Tx X8B_L4"
#string STR_PRE_USR_X8BL4                                #language en-US "Manual Preset - US Rx X8B_L4"


#string STR_PRE_DST_X8BL5                                #language en-US "Manual Preset - DS Tx X8B_L5"
#string STR_PRE_DSR_X8BL5                                #language en-US "Manual Preset - DS Rx X8B_L5"
#string STR_PRE_UST_X8BL5                                #language en-US "Manual Preset - US Tx X8B_L5"
#string STR_PRE_USR_X8BL5                                #language en-US "Manual Preset - US Rx X8B_L5"

#string STR_PRE_DST_X8BL6                                #language en-US "Manual Preset - DS Tx X8B_L6"
#string STR_PRE_DSR_X8BL6                                #language en-US "Manual Preset - DS Rx X8B_L6"
#string STR_PRE_UST_X8BL6                                #language en-US "Manual Preset - US Tx X8B_L6"
#string STR_PRE_USR_X8BL6                                #language en-US "Manual Preset - US Rx X8B_L6"

#string STR_PRE_DST_X8BL7                                #language en-US "Manual Preset - DS Tx X8B_L7"
#string STR_PRE_DSR_X8BL7                                #language en-US "Manual Preset - DS Rx X8B_L7"
#string STR_PRE_UST_X8BL7                                #language en-US "Manual Preset - US Tx X8B_L7"
#string STR_PRE_USR_X8BL7                                #language en-US "Manual Preset - US Rx X8B_L7"

#string STR_PRE_DST_X8CL0                                #language en-US "Manual Preset - DS Tx X8C_L0"
#string STR_PRE_DSR_X8CL0                                #language en-US "Manual Preset - DS Rx X8C_L0"
#string STR_PRE_UST_X8CL0                                #language en-US "Manual Preset - US Tx X8C_L0"
#string STR_PRE_USR_X8CL0                                #language en-US "Manual Preset - US Rx X8C_L0"

#string STR_PRE_DST_X8CL1                                #language en-US "Manual Preset - DS Tx X8C_L1"
#string STR_PRE_DSR_X8CL1                                #language en-US "Manual Preset - DS Rx X8C_L1"
#string STR_PRE_UST_X8CL1                                #language en-US "Manual Preset - US Tx X8C_L1"
#string STR_PRE_USR_X8CL1                                #language en-US "Manual Preset - US Rx X8C_L1"


#string STR_PRE_DST_X8CL2                                #language en-US "Manual Preset - DS Tx X8C_L2"
#string STR_PRE_DSR_X8CL2                                #language en-US "Manual Preset - DS Rx X8C_L2"
#string STR_PRE_UST_X8CL2                                #language en-US "Manual Preset - US Tx X8C_L2"
#string STR_PRE_USR_X8CL2                                #language en-US "Manual Preset - US Rx X8C_L2"

#string STR_PRE_DST_X8CL3                                #language en-US "Manual Preset - DS Tx X8C_L3"
#string STR_PRE_DSR_X8CL3                                #language en-US "Manual Preset - DS Rx X8C_L3"
#string STR_PRE_UST_X8CL3                                #language en-US "Manual Preset - US Tx X8C_L3"
#string STR_PRE_USR_X8CL3                                #language en-US "Manual Preset - US Rx X8C_L3"

#string STR_PRE_DST_X8CL4                                #language en-US "Manual Preset - DS Tx X8C_L4"
#string STR_PRE_DSR_X8CL4                                #language en-US "Manual Preset - DS Rx X8C_L4"
#string STR_PRE_UST_X8CL4                                #language en-US "Manual Preset - US Tx X8C_L4"
#string STR_PRE_USR_X8CL4                                #language en-US "Manual Preset - US Rx X8C_L4"


#string STR_PRE_DST_X8CL5                                #language en-US "Manual Preset - DS Tx X8C_L5"
#string STR_PRE_DSR_X8CL5                                #language en-US "Manual Preset - DS Rx X8C_L5"
#string STR_PRE_UST_X8CL5                                #language en-US "Manual Preset - US Tx X8C_L5"
#string STR_PRE_USR_X8CL5                                #language en-US "Manual Preset - US Rx X8C_L5"

#string STR_PRE_DST_X8CL6                                #language en-US "Manual Preset - DS Tx X8C_L6"
#string STR_PRE_DSR_X8CL6                                #language en-US "Manual Preset - DS Rx X8C_L6"
#string STR_PRE_UST_X8CL6                                #language en-US "Manual Preset - US Tx X8C_L6"
#string STR_PRE_USR_X8CL6                                #language en-US "Manual Preset - US Rx X8C_L6"

#string STR_PRE_DST_X8CL7                                #language en-US "Manual Preset - DS Tx X8C_L7"
#string STR_PRE_DSR_X8CL7                                #language en-US "Manual Preset - DS Rx X8C_L7"
#string STR_PRE_UST_X8CL7                                #language en-US "Manual Preset - US Tx X8C_L7"
#string STR_PRE_USR_X8CL7                                #language en-US "Manual Preset - US Rx X8C_L7"

#string STR_PRE_DST_X8AL0                                #language en-US "Manual Preset - DS Tx X8A_L0"
#string STR_PRE_DSR_X8AL0                                #language en-US "Manual Preset - DS Rx X8A_L0"
#string STR_PRE_UST_X8AL0                                #language en-US "Manual Preset - US Tx X8A_L0"
#string STR_PRE_USR_X8AL0                                #language en-US "Manual Preset - US Rx X8A_L0"

#string STR_PRE_DST_X8AL1                                #language en-US "Manual Preset - DS Tx X8A_L1"
#string STR_PRE_DSR_X8AL1                                #language en-US "Manual Preset - DS Rx X8A_L1"
#string STR_PRE_UST_X8AL1                                #language en-US "Manual Preset - US Tx X8A_L1"
#string STR_PRE_USR_X8AL1                                #language en-US "Manual Preset - US Rx X8A_L1"


#string STR_PRE_DST_X8AL2                                #language en-US "Manual Preset - DS Tx X8A_L2"
#string STR_PRE_DSR_X8AL2                                #language en-US "Manual Preset - DS Rx X8A_L2"
#string STR_PRE_UST_X8AL2                                #language en-US "Manual Preset - US Tx X8A_L2"
#string STR_PRE_USR_X8AL2                                #language en-US "Manual Preset - US Rx X8A_L2"

#string STR_PRE_DST_X8AL3                                #language en-US "Manual Preset - DS Tx X8A_L3"
#string STR_PRE_DSR_X8AL3                                #language en-US "Manual Preset - DS Rx X8A_L3"
#string STR_PRE_UST_X8AL3                                #language en-US "Manual Preset - US Tx X8A_L3"
#string STR_PRE_USR_X8AL3                                #language en-US "Manual Preset - US Rx X8A_L3"

#string STR_PRE_DST_X8AL4                                #language en-US "Manual Preset - DS Tx X8A_L4"
#string STR_PRE_DSR_X8AL4                                #language en-US "Manual Preset - DS Rx X8A_L4"
#string STR_PRE_UST_X8AL4                                #language en-US "Manual Preset - US Tx X8A_L4"
#string STR_PRE_USR_X8AL4                                #language en-US "Manual Preset - US Rx X8A_L4"


#string STR_PRE_DST_X8AL5                                #language en-US "Manual Preset - DS Tx X8A_L5"
#string STR_PRE_DSR_X8AL5                                #language en-US "Manual Preset - DS Rx X8A_L5"
#string STR_PRE_UST_X8AL5                                #language en-US "Manual Preset - US Tx X8A_L5"
#string STR_PRE_USR_X8AL5                                #language en-US "Manual Preset - US Rx X8A_L5"

#string STR_PRE_DST_X8AL6                                #language en-US "Manual Preset - DS Tx X8A_L6"
#string STR_PRE_DSR_X8AL6                                #language en-US "Manual Preset - DS Rx X8A_L6"
#string STR_PRE_UST_X8AL6                                #language en-US "Manual Preset - US Tx X8A_L6"
#string STR_PRE_USR_X8AL6                                #language en-US "Manual Preset - US Rx X8A_L6"

#string STR_PRE_DST_X8AL7                                #language en-US "Manual Preset - DS Tx X8A_L7"
#string STR_PRE_DSR_X8AL7                                #language en-US "Manual Preset - DS Rx X8A_L7"
#string STR_PRE_UST_X8AL7                                #language en-US "Manual Preset - US Tx X8A_L7"
#string STR_PRE_USR_X8AL7                                #language en-US "Manual Preset - US Rx X8A_L7"
#string STR_EMPTY                              #language en-US " "
#string STR_PCIE_RP                               #language en-US "PCIE Root Port"
#string STR_PCIE_PE0                           #language en-US "PCIE PE0 Control"
#string STR_PCIE_PE1                          #language en-US "PCIE PE1 Control"
#string STR_PCIE_PE2                           #language en-US "PCIE PE2 Control"
#string STR_PCIE_PE3                           #language en-US "PCIE PE3 Control"
#string STR_PCIE_PEG                      #language en-US "PCIE PEG Control"
#string STR_PCIE_PEG2                     #language en-US "PCIE PEG2 Control"
#string STR_PCIE_PEG3                      #language en-US "PCIE PEG3 Control"
#string STR_PCIE_PEG0                      #language en-US "PCIE PEG0 Control"
#string STR_PCIE_PEG1                              #language en-US "PCIE PEG1 Control"
#string STR_PCIE_HOTRST                                #language en-US "PCIE Hot-Reset Enable"
#string STR_PEMCU_LOADFW_WHENBOOT                                #language en-US "PEMCU Auto Load FW Eanble"
#string STR_PEMCU_RSTSYS_WHENFAIL                                #language en-US "PEMCU Reset When load FW fail"
#string STR_PCIE_OBFF_CTRL_PCIE                                #language en-US "PCIE OBFF Control"
#string STR_OBFF_WITH_PEXWAKE                                #language en-US "PCIE OBFF with PEXWAKE#"
#string STR_OBFF_WITH_MESSAGE                                #language en-US "PCIE OBFF with Message"
#string STR_MAT_PAYLOAD_SIZE                               #language en-US "Maximum Payload Size"
#string STR_KERNAL_CTRL_ITEMS                               #language en-US "Kernel Controlled Items"
#string STR_MAX_128M                           #language en-US "Max to 128 Bytes"
#string STR_MAX_256M                      #language en-US "Max to 256 Bytes"
#string STR_PCIE_ASPM                              #language en-US "Active State Power Management"
#string STR_RELAX_ORDER                                #language en-US "Relax Ordering"
#string STR_EXT_TAG                               #language en-US "Extended Tag Field"
#string STR_NO_SNOOP                           #language en-US "No Snoop"
#string STR_EXT_SYNC                      #language en-US "Extended Sync"
#string STR_SPECIALLY_SI_SETTING                      #language en-US "Specially SI setting for test"
#string STR_PCIE_SPECIALLY_SI_BIST                      #language en-US "STR_PCIE_SPECIALLY_SI_BIST"
#string STR_PCIE_ROUT_CTRL                      #language en-US "PCIE APIC/PIC Routing test"
#string STR_EXT_SYNC                      #language en-US "Extended Sync"
                              